ch9/ch9-3.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2019-06-06 Thu 03:07 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>&lrm;</title>
<meta name="generator" content="Org mode" />
<meta name="author" content="Travis CI User" />
</head>
<body>
<div id="content">
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#orgce3849c">1. ch9-3</a>
<ul>
<li><a href="#org892e080">1.1. 9.3-1</a></li>
<li><a href="#org199d160">1.2. 9.3-2</a></li>
<li><a href="#org89e8d6c">1.3. 9.3-3</a></li>
<li><a href="#org19d80c6">1.4. 9.3-4</a></li>
<li><a href="#org6e67114">1.5. 9.3-5</a></li>
<li><a href="#org01fda33">1.6. 9.3-6</a></li>
<li><a href="#orgc6c03f1">1.7. 9.3-7</a></li>
<li><a href="#orga29c9a4">1.8. 9.3-8</a></li>
<li><a href="#org9fa85a4">1.9. 9.3-9</a></li>
</ul>
</li>
</ul>
</div>
</div>
<div id="outline-container-orgce3849c" class="outline-2">
<h2 id="orgce3849c"><span class="section-number-2">1</span> ch9-3</h2>
<div class="outline-text-2" id="text-1">
</div>
<div id="outline-container-org892e080" class="outline-3">
<h3 id="org892e080"><span class="section-number-3">1.1</span> 9.3-1</h3>
<div class="outline-text-3" id="text-1-1">
<ul class="org-ul">
<li>When divided into groups of 7, We have
\(T(n) \leq T(n / 7) + T(5 n / 7 + 8) + O(n) = O(n)\)</li>
<li>When divided into groups of 3, We have
\(T(n) \leq T(n / 3) + T(2 n / 3 + 4) + O(n)\), which is not O(n).</li>
</ul>
</div>
</div>
<div id="outline-container-org199d160" class="outline-3">
<h3 id="org199d160"><span class="section-number-3">1.2</span> 9.3-2</h3>
<div class="outline-text-3" id="text-1-2">
<p>
\(n \geq 140\)
\(\Rightarrow \frac{3 n}{10} - 6 \geq \frac{n}{4} + 1\)
\(\Rightarrow \frac{3 n}{10} - 6 \geq \lceil \frac{n}{4} \rceil\)
</p>
</div>
</div>
<div id="outline-container-org89e8d6c" class="outline-3">
<h3 id="org89e8d6c"><span class="section-number-3">1.3</span> 9.3-3</h3>
<div class="outline-text-3" id="text-1-3">
<p>
Use SELECT to decide the pivot.
</p>
</div>
</div>
<div id="outline-container-org19d80c6" class="outline-3">
<h3 id="org19d80c6"><span class="section-number-3">1.4</span> 9.3-4</h3>
<div class="outline-text-3" id="text-1-4">
<p>
If we are using only comparisons to find the ith smallest element in a set 
of n elements, we can build a digraph from the elements to simulate the 
algorithm, each edge from vertex A[i] to vertex A[j] means A[i] &lt; A[j], 
then there must be a path between each other element and the ith smallest 
element, thus the i - 1 smaller elements and the n - 1 larger elements is 
determined.
</p>
</div>
</div>
<div id="outline-container-org6e67114" class="outline-3">
<h3 id="org6e67114"><span class="section-number-3">1.5</span> 9.3-5</h3>
<div class="outline-text-3" id="text-1-5">
<p>
Use MEDIAN to decide the pivot. (<a href="../codes/selection_use_median.py">implementation</a>)
</p>
</div>
</div>
<div id="outline-container-org01fda33" class="outline-3">
<h3 id="org01fda33"><span class="section-number-3">1.6</span> 9.3-6</h3>
<div class="outline-text-3" id="text-1-6">
<p>
Perform selection and partition of the median on the n-elements, then 
recursively find quantiles on the left and right subarrays.
</p>

<p>
KTH-QUANTILES(A, k)
</p>
<pre class="example">
KTH-QUANTILES(A, k)
    if k == 1
	return empty-list
    if 2 divide into k
	i = median-index of A
	median = SELECT(A, i)
	PARTITION(A, med)
	return APPEND(KTH-QUANTILES(A[:i], k // 2), [median], KTH-QUANTILES(A[i + 1:], k // 2))
    i = left-index of the median slice
    j = right-index of the median slice
    left = SELECT(A, i)
    right = SELECT(A, j)
    PARTITION(A, left)
    left-quantiles = KTH-QUANTILES(A[:i], k // 2)
    PARTITION(A, right)
    right-quantiles = KTH-QUANTILES(A[j + 1:], k // 2)
    return APPEND(left-quantiles, [left, right], right-quantiles)
</pre>

<p>
(<a href="../codes/kth_quantiles.py">implementation</a>)
</p>
</div>
</div>
<div id="outline-container-orgc6c03f1" class="outline-3">
<h3 id="orgc6c03f1"><span class="section-number-3">1.7</span> 9.3-7</h3>
<div class="outline-text-3" id="text-1-7">
<p>
K-CLOSEST-TO-MEDIAN(A, k)
</p>
<pre class="example">
K-CLOSEST-TO-MEDIAN(A, k)
    med = SELECT(A, median-index of A)
    x = SELECT(A, k) by ABS(A[i] - med)
    PARTITION(A, x) by ABS(A[i] - med)
    return A[1..k]
</pre>
</div>
</div>
<div id="outline-container-orga29c9a4" class="outline-3">
<h3 id="orga29c9a4"><span class="section-number-3">1.8</span> 9.3-8</h3>
<div class="outline-text-3" id="text-1-8">
<p>
MEDIAN-OF-TWO-ARRAYS(X, Y, n)
</p>
<pre class="example">
MEDIAN-OF-TWO-ARRAYS(X, Y)
    if MEDIAN(X) == MEDIAN(Y):
	return MEDIAN(X)
    if MEDIAN(X) &gt; MEDIAN(Y):
	return MEDIAN-OF-TWO-ARRAYS(left half of X, right half of Y)
    return MEDIAN-OF-TWO-ARRAYS(right half of X, left half of X)
</pre>
</div>
</div>
<div id="outline-container-org9fa85a4" class="outline-3">
<h3 id="org9fa85a4"><span class="section-number-3">1.9</span> 9.3-9</h3>
<div class="outline-text-3" id="text-1-9">
<p>
If n is odd, the y-coordinate of the main pipeline is the median of the n y-coordinates.
If n is even, the y-coordinate of the main pipeline can be any value between the two medians of the y-coordinates.
</p>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: Travis CI User</p>
<p class="date">Created: 2019-06-06 Thu 03:07</p>
<p class="validation"><a href="http://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
